Tekla.Structures.DialogInternal.RebarAttributes
Rebar attributes

Tekla.Structures.DialogInternal.RebarAttributes.Size
Gets or sets the size

Tekla.Structures.DialogInternal.RebarAttributes.Grade
Gets or sets the grade

Tekla.Structures.DialogInternal.RebarAttributes.BendingRadius
Gets or sets the bending radius

Tekla.Structures.DialogInternal.RebarAttributes.Usage
Gets or sets the usage

Tekla.Structures.DialogInternal.RebarAttributes.SelectedCallback
Gets or sets the rebar selected callback action.

Tekla.Structures.DialogInternal.RebarAttributes.ClosedCallback
Gets or sets the window closed callback action.